In [67]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\chanholee\anaconda3\lib\site-packages (1.0.2)

In [68]:
import pymysql

In [69]:
# MySQL Connection

conn = pymysql.connect(host="127.0.0.1", user="root", passwd="qwer1234", db="education", charset="utf8")

In [70]:
curs = conn.cursor()

In [61]:
sql = "select * from student"
curs.execute(sql)

13

In [62]:
# Data Fetch
rows = curs.fetchall()
print(rows)

(('123', 'mmm', 'mmmm', '123123', None), ('234', '234', '234', '234', None), ('444', 'rrr', 'rrr', '444', None), ('445', 'rrr', 'rrr', '445', None), ('454', 'rrr', 'rrr', '444', None), ('777', '7111', '777', '777', None), ('999', '999', '999', '999', None), ('S001', 'abc', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [63]:
# list로 변환

rowList = list(rows)
print(rowList)

[('123', 'mmm', 'mmmm', '123123', None), ('234', '234', '234', '234', None), ('444', 'rrr', 'rrr', '444', None), ('445', 'rrr', 'rrr', '445', None), ('454', 'rrr', 'rrr', '444', None), ('777', '7111', '777', '777', None), ('999', '999', '999', '999', None), ('S001', 'abc', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None)]

In [64]:
print(rowList[0]) # 튜플로 인식한다

('123', 'mmm', 'mmmm', '123123', None)

In [65]:
conn.close()

# select의 내용을 dataframe으로 보기

In [76]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\chanholee\anaconda3\lib\site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\chanholee\anaconda3\lib\site-packages (from sqlalchemy) (1.0.0)

In [72]:
import pandas as pd
from sqlalchemy import create_engine

In [77]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

In [78]:
#data = pd.read_sql_table('student', conn)
data = pd.read_sql_table('student',conn)
data

   scode sname   sdept    sphone saddress
0    123   mmm    mmmm    123123     None
1    234   234     234       234     None
2    444   rrr     rrr       444     None
3    445   rrr     rrr       445     None
4    454   rrr     rrr       444     None
5    777  7111     777       777     None
6    999   999     999       999     None
7   S001   abc  컴퓨터공학과  123-4567     None
8   S002   최민국  컴퓨터공학과  234-5678     None
9   S003   이승호    국문학과  345-6789     None
10  S004   정수봉    국문학과  456-7890     None
11  S005   김상진     사학과  567-8901     None
12  S006   황정숙     사학과  678-9012     None

# dataFrame을 Database로 insert하기

In [1]:
import pandas as pd
column = ['rank', "title"]
movies = pd.read_csv("./Data/DaumList.csv")
movies.columns = column
movies.head()

   rank        title
0     1       블랙 위도우
1     2         발신제한
2     3         크루엘라
3     4  콰이어트 플레이스 2
4     5           랑종

In [2]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

NameError: name 'create_engine' is not defined